[
  "La simplicité est la sophistication suprême. – Léonard de Vinci",
  "Le code est comme l’humour : s’il faut l’expliquer, c’est qu’il n’est pas bon.",
  "N’attends pas d’être grand pour coder, code pour devenir grand.",
  "Fais simple. Puis rends-le plus rapide.",
  "Les bugs sont des fonctionnalités déguisées.",
  "Un bon programmeur regarde des deux côtés avant de traverser une rue à sens unique.",
  "Le débogage, c'est comme être le détective dans un film policier où vous êtes aussi le meurtrier.",
  "Il n'y a que 10 types de personnes dans le monde : celles qui comprennent le binaire et celles qui ne le comprennent pas.",
  "Mesurer l'avancement de la programmation en lignes de code, c'est comme mesurer la construction d'un avion au poids.",
  "Ce n'est pas un bug, c'est une fonctionnalité non documentée.",
  "La meilleure documentation est le code source lui-même.",
  "L'optimisation prématurée est la racine de tous les maux.",
  "Si ça marche, ne touchez à rien.",
  "Un code propre est un code qui se lit comme de la prose bien écrite.",
  "Le meilleur message d'erreur est celui qui n'apparaît jamais.",
  "Marcher sur l'eau et développer un logiciel à partir d'une spécification sont faciles si les deux sont gelés.",
  "Tout imbécile peut écrire du code qu'un ordinateur peut comprendre. Les bons programmeurs écrivent du code que les humains peuvent comprendre.",
  "D'abord, résolvez le problème. Ensuite, écrivez le code.",
  "Java est à JavaScript ce que car est à carpet (voiture à tapis).",
  "Ne vous inquiétez pas si ça ne marche pas du premier coup. Si c'était le cas, vous n'auriez pas de travail.",
  "Le clavier le plus cher est celui qui ne fonctionne pas.",
  "Un programmeur est un organisme qui transforme le café en code.",
  "La théorie, c'est quand on sait tout et que rien ne fonctionne. La pratique, c'est quand tout fonctionne et que personne ne sait pourquoi. Ici, nous avons réuni théorie et pratique : rien ne fonctionne... et personne ne sait pourquoi !",
  "Le copier-coller est un péché de conception.",
  "Le code est votre héritage. Rendez-le lisible.",
  "Il y a deux manières de concevoir un logiciel : une manière est de le faire si simple qu'il n'y a évidemment aucune déficience. L'autre est de le faire si compliqué qu'il n'y a aucune déficience évidente.",
  "La plupart des bons programmeurs programment non pas parce qu'ils s'attendent à être payés ou à être acclamés, mais parce que c'est amusant de programmer.",
  "Le logiciel, c'est comme l'entropie. Difficile à saisir, ça ne pèse rien, et ça obéit à la deuxième loi de la thermodynamique ; c'est-à-dire que ça augmente toujours."
]